In [7]:
import pandas as pd
import numpy as np

In [8]:
ctd_df = pd.read_excel(r"/home/oskar-kiss/repos/antartic bacteria/mcmlter-lake-ctd-20231023.xlsx")

In [9]:
ctd_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76568 entries, 0 to 76567
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   dataset_code           76568 non-null  object
 1   limno_run              76568 non-null  object
 2   location_name          76568 non-null  object
 3   location_code          76568 non-null  object
 4   depth_m                76540 non-null  float64
 5   ctd_conductivity_mscm  76311 non-null  float64
 6   ctd_temp_c             76400 non-null  float64
 7   date_time              76568 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 4.7+ MB

In [10]:
ctd_df.head()

,dataset_code,limno_run,location_name,location_code,depth_m,ctd_conductivity_mscm,ctd_temp_c,date_time
0,LIMNO_CTD,JOY9394,Lake Joyce,JOYLT1,0.102,0.1017,0.020,1993-12-06
1,LIMNO_CTD,JOY9394,Lake Joyce,JOYLT1,0.204,0.1065,0.020,1993-12-06
2,LIMNO_CTD,JOY9394,Lake Joyce,JOYLT1,0.306,0.1079,0.020,1993-12-06
3,LIMNO_CTD,JOY9394,Lake Joyce,JOYLT1,0.408,0.1087,0.019,1993-12-06
4,LIMNO_CTD,JOY9394,Lake Joyce,JOYLT1,0.510,0.1162,0.020,1993-12-06

In [11]:
for c in ctd_df.select_dtypes("object").columns:
    print(f"{c} {len(set(ctd_df[c]))}")

dataset_code 1
limno_run 376
location_name 8
location_code 8

In [12]:
for c in ctd_df.select_dtypes("object").columns:
    ctd_df[c] = ctd_df[c].astype("category")

In [13]:
ctd_df.to_csv("/home/oskar-kiss/repos/antartic bacteria/mcmlter-lake-ctd-20231023.csv")

In [14]:
nutrient_df = pd.read_excel(r"/home/oskar-kiss/repos/antartic bacteria/data/raw_data/mcmlter-lake-nutrients-20220317 (1).xlsx")

In [17]:
nutrient_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5142 entries, 0 to 5141
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   dataset_code   5142 non-null   object
 1   limno_run      5142 non-null   object
 2   location_name  5142 non-null   object
 3   location_code  5142 non-null   object
 4   date_time      5142 non-null   datetime64[ns]
 5   depth_m        5141 non-null   float64
 6   nh4_um         4042 non-null   float64
 7   no2_um         3957 non-null   float64
 8   no3_um         4330 non-null   float64
 9   srp_um         3277 non-null   float64
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 401.8+ KB

In [18]:
nutrient_df.head()

,dataset_code,limno_run,location_name,location_code,date_time,depth_m,nh4_um,no2_um,no3_um,srp_um
0,LIMNO_NUTRIENTS,EB9394L1,East Lake Bonney,BONE30,1993-10-27,4.0,2.2,0.13,7.2,0.34
1,LIMNO_NUTRIENTS,EB9394L1,East Lake Bonney,BONE30,1993-10-27,6.0,1.6,0.11,7.2,0.47
2,LIMNO_NUTRIENTS,EB9394L1,East Lake Bonney,BONE30,1993-10-27,8.0,0.6,0.12,9.8,0.36
3,LIMNO_NUTRIENTS,EB9394L1,East Lake Bonney,BONE30,1993-10-27,10.0,0.5,0.13,11.9,0.28
4,LIMNO_NUTRIENTS,EB9394L1,East Lake Bonney,BONE30,1993-10-27,12.0,1.8,0.18,16.6,0.58

In [19]:
for c in nutrient_df.select_dtypes("object").columns:
    print(f"{c} {len(set(ctd_df[c]))}")

dataset_code 1
limno_run 376
location_name 8
location_code 8

In [20]:
for c in ctd_df.select_dtypes("object").columns:
    ctd_df[c] = ctd_df[c].astype("category")

In [23]:
nutrient_df.to_csv("/home/oskar-kiss/repos/antartic bacteria/data/clean_data/nutrient_measurements_clean.csv")

In [24]:
par_df = pd.read_excel("/home/oskar-kiss/repos/antartic bacteria/data/raw_data/mcmlter-lake-par_profile-20240109.xlsx")

In [25]:
par_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15336 entries, 0 to 15335
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   dataset_code            15336 non-null  object
 1   location_name           15336 non-null  object
 2   location_code           15336 non-null  object
 3   limno_run               15336 non-null  object
 4   date_time               15336 non-null  datetime64[ns]
 5   depth_m                 15325 non-null  float64
 6   uwpar_umol_photons_m2s  15322 non-null  float64
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 838.8+ KB

In [26]:
par_df.head()

,dataset_code,location_name,location_code,limno_run,date_time,depth_m,uwpar_umol_photons_m2s
0,LIMNO_PAR_PROFILE,West Lake Bonney,BONW20,WB9394L1,1993-10-28,4.0,26.32
1,LIMNO_PAR_PROFILE,West Lake Bonney,BONW20,WB9394L1,1993-10-28,4.5,23.18
2,LIMNO_PAR_PROFILE,West Lake Bonney,BONW20,WB9394L1,1993-10-28,5.0,21.14
3,LIMNO_PAR_PROFILE,West Lake Bonney,BONW20,WB9394L1,1993-10-28,5.5,18.90
4,LIMNO_PAR_PROFILE,West Lake Bonney,BONW20,WB9394L1,1993-10-28,6.0,17.33

In [27]:
for c in par_df.select_dtypes("object").columns:
    print(f"{c} {len(set(ctd_df[c]))}")

dataset_code 1
location_name 8
location_code 8
limno_run 376

In [28]:
for c in ctd_df.select_dtypes("object").columns:
    ctd_df[c] = ctd_df[c].astype("category")

In [29]:
par_df.to_csv("/home/oskar-kiss/repos/antartic bacteria/data/clean_data/par_measurements_clean.csv")